;;;; DM80L№1_100_10_NIL-6_trd.lisp

(in-package #:recoder)

(progn
  (defparameter *ht-s-o* (make-hash-table :test 'equal))
  (let ((s-o
	 '(("GQ010"    "Ne")
	   ("EN1"      "n<sub>КНД</sub>")
	   ("EN2"      "n<sub>КВД</sub>")
	   ("T04"      "t<sub>04</sub>")

	   ("dT04plus"  "Δt<sub>04max</sub>")
	   ("dT04minus" "Δt<sub>04min</sub>")
           ("T01"       "t<sub>НВ</sub>")
           ("P02"       "p<sub>2</sub>")
	   ("FT020"     "t<sub>ДТ</sub>")
	   ("FP210"     "p<sub>КДТ1</sub>")
	   ("FP220"     "p<sub>КДТ2</sub>")
	   ("FA020"     "K<sub>ДТ</sub>")
	   ("FQ110"     "G<sub>ДТ</sub>")
	   ("FT010"     "t<sub>ГТ</sub>")
	   ("FP230"     "p<sub>КГТ3</sub>")
	   ("FA010"     "K<sub>ГТ</sub>")
	   ("FQ010"     "G<sub>ГТ</sub>")
	   ("PT240"     "t<sub>В_ПР_КДТ1</sub>")
	   ("PT230"     "t<sub>В_ПР_КДТ2</sub>")
	   ("PT250"     "t<sub>В_ПР_КГТ3</sub>")
	   
	   ("EB100"     "П<sub>КС.1</sub>")
	   ("EB110"     "П<sub>КС.2</sub>")
	   ("EB120"     "П<sub>КС.3</sub>")
	   
	   ("TSI_T165" "t<sub>02.1</sub>")
	   ("TSI_T166" "t<sub>02.2</sub>")
	   ("TSI_T167" "t<sub>02.3</sub>")
	   ("TSI_T168" "t<sub>02.4</sub>")
	   ("TSI_T169" "t<sub>02.5</sub>")

	   ("TSI_T000" "t<sub>ЖТ3.1</sub>")
	   ("TSI_T030" "t<sub>ЖТ3.2</sub>")
	   ("TSI_T031" "t<sub>ЖТ3.3</sub>")
	   ("TSI_T032" "t<sub>ЖТ3.4</sub>")
	   ("TSI_T033" "t<sub>ЖТ3.5</sub>")
	   ("TSI_T001" "t<sub>ЖТ3.6</sub>")
	   ("TSI_T002" "t<sub>ЖТ3.7</sub>")
	   ("TSI_T003" "t<sub>ЖТ3.8</sub>")
	   ("TSI_T004" "t<sub>ЖТ3.9</sub>")
	   ("TSI_T035" "t<sub>ЖТ3.10</sub>")
	   ("TSI_T036" "t<sub>ЖТ3.11</sub>")
	   ("TSI_T037" "t<sub>ЖТ3.12</sub>")
	   ("TSI_T038" "t<sub>ЖТ3.13</sub>")
	   ("TSI_T005" "t<sub>ЖТ3.14</sub>")
	   ("TSI_T006" "t<sub>ЖТ3.15</sub>")
	   ("TSI_T007" "t<sub>ЖТ3.16</sub>")
	   ("TSI_T008" "t<sub>ЖТ3.17</sub>")
	   ("TSI_T039" "t<sub>ЖТ3.18</sub>")
	   ("TSI_T040" "t<sub>ЖТ3.19</sub>")
	   ("TSI_T041" "t<sub>ЖТ3.20</sub>")

	   ("TSI_T042" "t<sub>ЖТ3.21</sub>")
	   ("TSI_T043" "t<sub>ЖТ3.21</sub>")

	   ("TSI_T009" "t<sub>ЖТ3.22</sub>")
	   ("TSI_T010" "t<sub>ЖТ3.23</sub>")
	   ("TSI_T011" "t<sub>ЖТ3.24</sub>")
	   ("TSI_T044" "t<sub>ЖТ3.25</sub>")
	   ("TSI_T045" "t<sub>ЖТ3.26</sub>")

	   ("TSI_T047" "t<sub>ЖТ3.28</sub>")
	   ("TSI_T046" "t<sub>ЖТ3.29</sub>")
	   ("TSI_T012" "t<sub>ЖТ3.30</sub>")
	   ("TSI_T013" "t<sub>ЖТ3.31</sub>")
	   ("TSI_T014" "t<sub>ЖТ3.32</sub>")
	   ("TSI_T048" "t<sub>ЖТ3.33</sub>")
	   ("TSI_T049" "t<sub>ЖТ3.34</sub>")
	   ("TSI_T034" "t<sub>ЖТ3.35</sub>")

	   ("TSI_T015" "t<sub>ЖТ3.36</sub>")
	   ("TSI_T050" "t<sub>ЖТ3.36</sub>")

	   ("TSI_T051" "t<sub>ЖТ3.37</sub>")
	   ("TSI_T016" "t<sub>ЖТ3.38</sub>")
	   ("TSI_T017" "t<sub>ЖТ3.39</sub>")
	   ("TSI_T018" "t<sub>ЖТ3.40</sub>")
	   ("TSI_T052" "t<sub>ЖТ3.41</sub>")
	   ("TSI_T053" "t<sub>ЖТ3.42</sub>")
	   ("TSI_T054" "t<sub>ЖТ3.43</sub>")
	   ("TSI_T019" "t<sub>ЖТ3.44</sub>")
	   ("TSI_T055" "t<sub>ЖТ3.45</sub>")
	   ("TSI_T056" "t<sub>ЖТ3.46</sub>")
	   ("TSI_T057" "t<sub>ЖТ3.47</sub>")
	   ("TSI_T020" "t<sub>ЖТ3.48</sub>")
	   ("TSI_T058" "t<sub>ЖТ3.49</sub>")
	   ("TSI_T059" "t<sub>ЖТ3.50</sub>")
	   ("TSI_T060" "t<sub>ЖТ3.51</sub>")
	   ("TSI_T061" "t<sub>ЖТ3.52</sub>")
	   ("TSI_T021" "t<sub>ЖТ3.53</sub>")
	   ("TSI_T022" "t<sub>ЖТ3.54</sub>")
	   ("TSI_T023" "t<sub>ЖТ3.55</sub>")
	   ("TSI_T062" "t<sub>ЖТ3.56</sub>")
	   ("TSI_T065" "t<sub>ЖТ3.57</sub>")
	   ("TSI_T064" "t<sub>ЖТ3.58</sub>")
	   ("TSI_T063" "t<sub>ЖТ3.59</sub>")
	   ("TSI_T067" "t<sub>ЖТ3.60</sub>")
	   ("TSI_T024" "t<sub>ЖТ3.61</sub>")
	   ("TSI_T025" "t<sub>ЖТ3.62</sub>")
	   ("TSI_T026" "t<sub>ЖТ3.63</sub>")
	   ("TSI_T068" "t<sub>ЖТ3.64</sub>")
	   ("TSI_T069" "t<sub>ЖТ3.65</sub>")
	   ("TSI_T066" "t<sub>ЖТ3.66</sub>")
	   ("TSI_T070" "t<sub>ЖТ3.67</sub>")
	   ("TSI_T071" "t<sub>ЖТ3.68</sub>")

	   ("TSI_T027" "t<sub>ЖТ3.70</sub>")
	   ("TSI_T028" "t<sub>ЖТ3.71</sub>")
	   ("TSI_T072" "t<sub>ЖТ3.72</sub>")
	   ("TSI_T073" "t<sub>ЖТ3.73</sub>")
	   ("TSI_T074" "t<sub>ЖТ3.74</sub>")
	   ("TSI_T029" "t<sub>ЖТ3.75</sub>")
	   ("TSI_T075" "t<sub>ЖТ3.76</sub>")


	   ("TSI_T111" "t<sub>ЖТ15.1</sub>")
	   ("TSI_T112" "t<sub>ЖТ15.2</sub>")
	   ("TSI_T113" "t<sub>ЖТ15.3</sub>")
	   ("TSI_T114" "t<sub>ЖТ15.4</sub>")
	   ("TSI_T080" "t<sub>ЖТ15.5</sub>")
	   ("TSI_T081" "t<sub>ЖТ15.6</sub>")
	   ("TSI_T082" "t<sub>ЖТ15.7</sub>")
	   ("TSI_T115" "t<sub>ЖТ15.8</sub>")
	   ("TSI_T116" "t<sub>ЖТ15.9</sub>")
	   ("TSI_T117" "t<sub>ЖТ15.10</sub>")
	   ("TSI_T118" "t<sub>ЖТ15.11</sub>")
	   ("TSI_T119" "t<sub>ЖТ15.12</sub>")
	   ("TSI_T083" "t<sub>ЖТ15.13</sub>")
	   ("TSI_T084" "t<sub>ЖТ15.14</sub>")
	   ("TSI_T085" "t<sub>ЖТ15.15</sub>")

	   ("TSI_T086" "t<sub>ЖТ15.16</sub>")
	   ("TSI_T120" "t<sub>ЖТ15.16</sub>")

	   ("TSI_T121" "t<sub>ЖТ15.17</sub>")
	   ("TSI_T122" "t<sub>ЖТ15.18</sub>")
	   ("TSI_T123" "t<sub>ЖТ15.19</sub>")
	   ("TSI_T124" "t<sub>ЖТ15.20</sub>")
	   ("TSI_T087" "t<sub>ЖТ15.21</sub>")
	   ("TSI_T088" "t<sub>ЖТ15.22</sub>")
	   ("TSI_T089" "t<sub>ЖТ15.23</sub>")
	   ("TSI_T125" "t<sub>ЖТ15.24</sub>")
	   ("TSI_T126" "t<sub>ЖТ15.25</sub>")
	   ("TSI_T127" "t<sub>ЖТ15.26</sub>")
	   ("TSI_T128" "t<sub>ЖТ15.27</sub>")
	   ("TSI_T129" "t<sub>ЖТ15.28</sub>")
	   ("TSI_T130" "t<sub>ЖТ15.29</sub>")
	   ("TSI_T090" "t<sub>ЖТ15.30</sub>")
	   ("TSI_T091" "t<sub>ЖТ15.31</sub>")
	   ("TSI_T131" "t<sub>ЖТ15.32</sub>")
	   ("TSI_T132" "t<sub>ЖТ15.33</sub>")
	   ("TSI_T133" "t<sub>ЖТ15.34</sub>")
	   ("TSI_T134" "t<sub>ЖТ15.35</sub>")
	   ("TSI_T135" "t<sub>ЖТ15.36</sub>")
	   ("TSI_T092" "t<sub>ЖТ15.37</sub>")
	   ("TSI_T093" "t<sub>ЖТ15.38</sub>")
	   ("TSI_T094" "t<sub>ЖТ15.39</sub>")
	   ("TSI_T136" "t<sub>ЖТ15.40</sub>")
	   ("TSI_T137" "t<sub>ЖТ15.41</sub>")
	   ("TSI_T138" "t<sub>ЖТ15.42</sub>")
	   ("TSI_T095" "t<sub>ЖТ15.43</sub>")

	   ("TSI_T139" "t<sub>ЖТ15.45</sub>")
	   ("TSI_T097" "t<sub>ЖТ15.45</sub>")

	   ("TSI_T140" "t<sub>ЖТ15.46</sub>")
	   ("TSI_T098" "t<sub>ЖТ15.47</sub>")
	   ("TSI_T099" "t<sub>ЖТ15.48</sub>")
	   ("TSI_T141" "t<sub>ЖТ15.49</sub>")
	   ("TSI_T142" "t<sub>ЖТ15.50</sub>")
	   ("TSI_T143" "t<sub>ЖТ15.51</sub>")
	   ("TSI_T144" "t<sub>ЖТ15.52</sub>")

	   ("TSI_T096" "t<sub>ЖТ15.54</sub>")
	   ("TSI_T100" "t<sub>ЖТ15.55</sub>")
	   ("TSI_T145" "t<sub>ЖТ15.56</sub>")
	   ("TSI_T101" "t<sub>ЖТ15.57</sub>")
	   ("TSI_T146" "t<sub>ЖТ15.58</sub>")
	   ("TSI_T147" "t<sub>ЖТ15.59</sub>")
	   ("TSI_T151" "t<sub>ЖТ15.60</sub>")

	   ("TSI_T102" "t<sub>ЖТ15.62</sub>")
	   ("TSI_T152" "t<sub>ЖТ15.63</sub>")
	   ("TSI_T153" "t<sub>ЖТ15.64</sub>")
	   ("TSI_T154" "t<sub>ЖТ15.65</sub>")
	   ("TSI_T155" "t<sub>ЖТ15.66</sub>")

	   ("TSI_T156" "t<sub>ЖТ15.67</sub>")
	   ("TSI_T157" "t<sub>ЖТ15.67</sub>")

	   ("TSI_T158" "t<sub>ЖТ15.68</sub>")
	   ("TSI_T103" "t<sub>ЖТ15.69</sub>")
	   ("TSI_T104" "t<sub>ЖТ15.70</sub>")
	   ("TSI_T159" "t<sub>ЖТ15.71</sub>")
	   ("TSI_T160" "t<sub>ЖТ15.72</sub>")
	   ("TSI_T161" "t<sub>ЖТ15.73</sub>")
	   ("TSI_T162" "t<sub>ЖТ15.74</sub>")
	   ("TSI_T163" "t<sub>ЖТ15.75</sub>")
	   ("TSI_T164" "t<sub>ЖТ15.76</sub>")

	   )))
    (mapc #'(lambda (el) (setf (gethash (first el) *ht-s-o*) (second el)))  s-o)))

(progn (defparameter *t-nil6* (make-instance 'trd :trd-file-name "~/develop/TRD/DM80L№1-100-10/NIL-6/20170123_090853.trd")) (trd-open *t-nil6*))

(progn (defparameter *T02* (trd-analog-signal-list *t-nil6* '("GQ010" "EN1" "EN2" "T04" "TSI_T165" "TSI_T166" "TSI_T167" "TSI_T168" "TSI_T169"))) *T02*)

(progn 
  (defparameter *d-t02*
    (mapcar #'(lambda (el) (trd-mid-values-by-udate *t-nil6* el  *T02*))
	    (list(encode-universal-time 00 21 9  23 1 2017) ;;;; 1.0 МВт
		 (encode-universal-time 07 31 9  23 1 2017) ;;;; 4.0 МВт
		 (encode-universal-time 50 42 9  23 1 2017) ;;;; 8.0 МВт
		 (encode-universal-time 19 52 9  23 1 2017) ;;;; 11.0 МВт
		 (encode-universal-time 02 12 10 23 1 2017) ;;;; 14.0 МВт
		 (encode-universal-time 18 33 10 23 1 2017) ;;;; 16.0 МВт
		 (encode-universal-time 53 53 10 23 1 2017) ;;;; 18.0 МВт
		 (encode-universal-time 53 12 11 23 1 2017) ;;;; 20.8 МВт
		 (encode-universal-time 16 33 11 23 1 2017) ;;;; 23.16 МВт
		 )))
  (push (mapcar #'(lambda (el) (a-signal-units el) ) *T02* ) *d-t02*)
  (push (mapcar #'(lambda (el) (a-signal-id el) ) *T02* ) *d-t02*)
  (push (mapcar #'(lambda (el) (gethash (a-signal-id el) *ht-s-o*)) *T02* ) *d-t02*)
  (html-table:list-list-html-table *d-t02* "~/rez-nil6-t02.html"))




(progn (defparameter *GT-3-t-1-8-lst* (trd-analog-signal-list *t* '("TSI_T000" "TSI_T030" "TSI_T031" "TSI_T032" "TSI_T033" "TSI_T001" "TSI_T002" "TSI_T003"))) *GT-3-t-1-8-lst*)

(progn (defparameter *GT-3-t-9-16-lst* (trd-analog-signal-list *t* '("TSI_T004" "TSI_T035" "TSI_T036" "TSI_T037" "TSI_T038" "TSI_T005" "TSI_T006" "TSI_T007"))) *GT-3-t-9-16-lst*)

(progn (defparameter *GT-15-t-1-8-lst* (trd-analog-signal-list *t* '("TSI_T111" "TSI_T112" "TSI_T113" "TSI_T114" "TSI_T080" "TSI_T081" "TSI_T082" "TSI_T115"))) *GT-15-t-1-8-lst*)

(trd-value-list-by-udate *t*  (encode-universal-time 04 18 11 23 1 2017) *GT-3-t-9-16-lst*)


 0 "TSI_T000" [0.0d0 1300.0d0] "°C" "3ЖТ_1"
30 "TSI_T030" [0.0d0 1300.0d0] "°C" "3ЖТ_2"
31 "TSI_T031" [0.0d0 1300.0d0] "°C" "3ЖТ_3"
32 "TSI_T032" [0.0d0 1300.0d0] "°C" "3ЖТ_4"
33 "TSI_T033" [0.0d0 1300.0d0] "°C" "3ЖТ_5"
 1 "TSI_T001" [0.0d0 1300.0d0] "°C" "3ЖТ_6"
 2 "TSI_T002" [0.0d0 1300.0d0] "°C" "3ЖТ_7"
 3 "TSI_T003" [0.0d0 1300.0d0] "°C" "3ЖТ_8"
 4 "TSI_T004" [0.0d0 1300.0d0] "°C" "3ЖТ_9"
35 "TSI_T035" [0.0d0 1300.0d0] "°C" "3ЖТ_10"
36 "TSI_T036" [0.0d0 1300.0d0] "°C" "3ЖТ_11"
37 "TSI_T037" [0.0d0 1300.0d0] "°C" "3ЖТ_12"
38 "TSI_T038" [0.0d0 1300.0d0] "°C" "3ЖТ_13"
 5 "TSI_T005" [0.0d0 1300.0d0] "°C" "3ЖТ_14"
 6 "TSI_T006" [0.0d0 1300.0d0] "°C" "3ЖТ_15"
 7 "TSI_T007" [0.0d0 1300.0d0] "°C" "3ЖТ_16"
 8 "TSI_T008" [0.0d0 1300.0d0] "°C" "3ЖТ_17"
39 "TSI_T039" [0.0d0 1300.0d0] "°C" "3ЖТ_18"
40 "TSI_T040" [0.0d0 1300.0d0] "°C" "3ЖТ_19"
41 "TSI_T041" [0.0d0 1300.0d0] "°C" "3ЖТ_20"

42 "TSI_T042" [0.0d0 1300.0d0] "°C" "3ЖТ_21"
43 "TSI_T043" [0.0d0 1300.0d0] "°C" "3ЖТ_21"

 9 "TSI_T009" [0.0d0 1300.0d0] "°C" "3ЖТ_22"
10 "TSI_T010" [0.0d0 1300.0d0] "°C" "3ЖТ_23"
11 "TSI_T011" [0.0d0 1300.0d0] "°C" "3ЖТ_24"
44 "TSI_T044" [0.0d0 1300.0d0] "°C" "3ЖТ_25"
45 "TSI_T045" [0.0d0 1300.0d0] "°C" "3ЖТ_26"

47 "TSI_T047" [0.0d0 1300.0d0] "°C" "3ЖТ_28"
46 "TSI_T046" [0.0d0 1300.0d0] "°C" "3ЖТ_29"
12 "TSI_T012" [0.0d0 1300.0d0] "°C" "3ЖТ_30"
13 "TSI_T013" [0.0d0 1300.0d0] "°C" "3ЖТ_31"
14 "TSI_T014" [0.0d0 1300.0d0] "°C" "3ЖТ_32"
48 "TSI_T048" [0.0d0 1300.0d0] "°C" "3ЖТ_33"
49 "TSI_T049" [0.0d0 1300.0d0] "°C" "3ЖТ_34"
34 "TSI_T034" [0.0d0 1300.0d0] "°C" "3ЖТ_35"

15 "TSI_T015" [0.0d0 1300.0d0] "°C" "3ЖТ_36"
50 "TSI_T050" [0.0d0 1300.0d0] "°C" "3ЖТ_36"

51 "TSI_T051" [0.0d0 1300.0d0] "°C" "3ЖТ_37"
16 "TSI_T016" [0.0d0 1300.0d0] "°C" "3ЖТ_38"
17 "TSI_T017" [0.0d0 1300.0d0] "°C" "3ЖТ_39"
18 "TSI_T018" [0.0d0 1300.0d0] "°C" "3ЖТ_40"
52 "TSI_T052" [0.0d0 1300.0d0] "°C" "3ЖТ_41"
53 "TSI_T053" [0.0d0 1300.0d0] "°C" "3ЖТ_42"
54 "TSI_T054" [0.0d0 1300.0d0] "°C" "3ЖТ_43"
19 "TSI_T019" [0.0d0 1300.0d0] "°C" "3ЖТ_44"
55 "TSI_T055" [0.0d0 1300.0d0] "°C" "3ЖТ_45"
56 "TSI_T056" [0.0d0 1300.0d0] "°C" "3ЖТ_46"
57 "TSI_T057" [0.0d0 1300.0d0] "°C" "3ЖТ_47"
20 "TSI_T020" [0.0d0 1300.0d0] "°C" "3ЖТ_48"
58 "TSI_T058" [0.0d0 1300.0d0] "°C" "3ЖТ_49"
59 "TSI_T059" [0.0d0 1300.0d0] "°C" "3ЖТ_50"
60 "TSI_T060" [0.0d0 1300.0d0] "°C" "3ЖТ_51"
61 "TSI_T061" [0.0d0 1300.0d0] "°C" "3ЖТ_52"
21 "TSI_T021" [0.0d0 1300.0d0] "°C" "3ЖТ_53"
22 "TSI_T022" [0.0d0 1300.0d0] "°C" "3ЖТ_54"
23 "TSI_T023" [0.0d0 1300.0d0] "°C" "3ЖТ_55"
62 "TSI_T062" [0.0d0 1300.0d0] "°C" "3ЖТ_56"
65 "TSI_T065" [0.0d0 1300.0d0] "°C" "3ЖТ_57"
64 "TSI_T064" [0.0d0 1300.0d0] "°C" "3ЖТ_58"
63 "TSI_T063" [0.0d0 1300.0d0] "°C" "3ЖТ_59"
67 "TSI_T067" [0.0d0 1300.0d0] "°C" "3ЖТ_60"
24 "TSI_T024" [0.0d0 1300.0d0] "°C" "3ЖТ_61"
25 "TSI_T025" [0.0d0 1300.0d0] "°C" "3ЖТ_62"
26 "TSI_T026" [0.0d0 1300.0d0] "°C" "3ЖТ_63"
68 "TSI_T068" [0.0d0 1300.0d0] "°C" "3ЖТ_64"
69 "TSI_T069" [0.0d0 1300.0d0] "°C" "3ЖТ_65"
66 "TSI_T066" [0.0d0 1300.0d0] "°C" "3ЖТ_66"
70 "TSI_T070" [0.0d0 1300.0d0] "°C" "3ЖТ_67"
71 "TSI_T071" [0.0d0 1300.0d0] "°C" "3ЖТ_68"

27 "TSI_T027" [0.0d0 1300.0d0] "°C" "3ЖТ_70"
28 "TSI_T028" [0.0d0 1300.0d0] "°C" "3ЖТ_71"
72 "TSI_T072" [0.0d0 1300.0d0] "°C" "3ЖТ_72"
73 "TSI_T073" [0.0d0 1300.0d0] "°C" "3ЖТ_73"
74 "TSI_T074" [0.0d0 1300.0d0] "°C" "3ЖТ_74"
29 "TSI_T029" [0.0d0 1300.0d0] "°C" "3ЖТ_75"
75 "TSI_T075" [0.0d0 1300.0d0] "°C" "3ЖТ_76"












76 "TSI_T076" [0.0d0 1300.0d0] "°C" ""
77 "TSI_T077" [0.0d0 1300.0d0] "°C" ""
78 "TSI_T078" [0.0d0 1300.0d0] "°C" ""
79 "TSI_T079" [0.0d0 1300.0d0] "°C" ""


110 "TSI_T111" [0.0d0 1300.0d0] "°C" "15ЖТ_1"
111 "TSI_T112" [0.0d0 1300.0d0] "°C" "15ЖТ_2"
112 "TSI_T113" [0.0d0 1300.0d0] "°C" "15ЖТ_3"
113 "TSI_T114" [0.0d0 1300.0d0] "°C" "15ЖТ_4"
 80 "TSI_T080" [0.0d0 1300.0d0] "°C" "15ЖТ_5"
 81 "TSI_T081" [0.0d0 1300.0d0] "°C" "15ЖТ_6"
 82 "TSI_T082" [0.0d0 1300.0d0] "°C" "15ЖТ_7"
114 "TSI_T115" [0.0d0 1300.0d0] "°C" "15ЖТ_8"
115 "TSI_T116" [0.0d0 1300.0d0] "°C" "15ЖТ_9"
116 "TSI_T117" [0.0d0 1300.0d0] "°C" "15ЖТ_10"
117 "TSI_T118" [0.0d0 1300.0d0] "°C" "15ЖТ_11"
118 "TSI_T119" [0.0d0 1300.0d0] "°C" "15ЖТ_12"
 83 "TSI_T083" [0.0d0 1300.0d0] "°C" "15ЖТ_13"
 84 "TSI_T084" [0.0d0 1300.0d0] "°C" "15ЖТ_14"
 85 "TSI_T085" [0.0d0 1300.0d0] "°C" "15ЖТ_15"

 86 "TSI_T086" [0.0d0 1300.0d0] "°C" "15ЖТ_16"
119 "TSI_T120" [0.0d0 1300.0d0] "°C" "15ЖТ_16"

120 "TSI_T121" [0.0d0 1300.0d0] "°C" "15ЖТ_17"
121 "TSI_T122" [0.0d0 1300.0d0] "°C" "15ЖТ_18"
122 "TSI_T123" [0.0d0 1300.0d0] "°C" "15ЖТ_19"
123 "TSI_T124" [0.0d0 1300.0d0] "°C" "15ЖТ_20"
 87 "TSI_T087" [0.0d0 1300.0d0] "°C" "15ЖТ_21"
 88 "TSI_T088" [0.0d0 1300.0d0] "°C" "15ЖТ_22"
 89 "TSI_T089" [0.0d0 1300.0d0] "°C" "15ЖТ_23"
124 "TSI_T125" [0.0d0 1300.0d0] "°C" "15ЖТ_24"
125 "TSI_T126" [0.0d0 1300.0d0] "°C" "15ЖТ_25"
126 "TSI_T127" [0.0d0 1300.0d0] "°C" "15ЖТ_26"
127 "TSI_T128" [0.0d0 1300.0d0] "°C" "15ЖТ_27"
128 "TSI_T129" [0.0d0 1300.0d0] "°C" "15ЖТ_28"
129 "TSI_T130" [0.0d0 1300.0d0] "°C" "15ЖТ_29"
 90 "TSI_T090" [0.0d0 1300.0d0] "°C" "15ЖТ_30"
 91 "TSI_T091" [0.0d0 1300.0d0] "°C" "15ЖТ_31"
130 "TSI_T131" [0.0d0 1300.0d0] "°C" "15ЖТ_32"
131 "TSI_T132" [0.0d0 1300.0d0] "°C" "15ЖТ_33"
132 "TSI_T133" [0.0d0 1300.0d0] "°C" "15ЖТ_34"
133 "TSI_T134" [0.0d0 1300.0d0] "°C" "15ЖТ_35"
134 "TSI_T135" [0.0d0 1300.0d0] "°C" "15ЖТ_36"
 92 "TSI_T092" [0.0d0 1300.0d0] "°C" "15ЖТ_37"
 93 "TSI_T093" [0.0d0 1300.0d0] "°C" "15ЖТ_38"
 94 "TSI_T094" [0.0d0 1300.0d0] "°C" "15ЖТ_39"
135 "TSI_T136" [0.0d0 1300.0d0] "°C" "15ЖТ_40"
136 "TSI_T137" [0.0d0 1300.0d0] "°C" "15ЖТ_41"
137 "TSI_T138" [0.0d0 1300.0d0] "°C" "15ЖТ_42"
 95 "TSI_T095" [0.0d0 1300.0d0] "°C" "15ЖТ_43"

138 "TSI_T139" [0.0d0 1300.0d0] "°C" "15ЖТ_45"
97 "TSI_T097" [0.0d0 1300.0d0] "°C" "15ЖТ_45"

139 "TSI_T140" [0.0d0 1300.0d0] "°C" "15ЖТ_46"
98 "TSI_T098" [0.0d0 1300.0d0] "°C" "15ЖТ_47"
99 "TSI_T099" [0.0d0 1300.0d0] "°C" "15ЖТ_48"
140 "TSI_T141" [0.0d0 1300.0d0] "°C" "15ЖТ_49"
141 "TSI_T142" [0.0d0 1300.0d0] "°C" "15ЖТ_50"
142 "TSI_T143" [0.0d0 1300.0d0] "°C" "15ЖТ_51"
143 "TSI_T144" [0.0d0 1300.0d0] "°C" "15ЖТ_52"

 96 "TSI_T096" [0.0d0 1300.0d0] "°C" "15ЖТ_54"
100 "TSI_T100" [0.0d0 1300.0d0] "°C" "15ЖТ_55"
144 "TSI_T145" [0.0d0 1300.0d0] "°C" "15ЖТ_56"
101 "TSI_T101" [0.0d0 1300.0d0] "°C" "15ЖТ_57"
145 "TSI_T146" [0.0d0 1300.0d0] "°C" "15ЖТ_58"
146 "TSI_T147" [0.0d0 1300.0d0] "°C" "15ЖТ_59"
147 "TSI_T151" [0.0d0 1300.0d0] "°C" "15ЖТ_60"

102 "TSI_T102" [0.0d0 1300.0d0] "°C" "15ЖТ_62"
148 "TSI_T152" [0.0d0 1300.0d0] "°C" "15ЖТ_63"
149 "TSI_T153" [0.0d0 1300.0d0] "°C" "15ЖТ_64"
150 "TSI_T154" [0.0d0 1300.0d0] "°C" "15ЖТ_65"
151 "TSI_T155" [0.0d0 1300.0d0] "°C" "15ЖТ_66"

152 "TSI_T156" [0.0d0 1300.0d0] "°C" "15ЖТ_67"
153 "TSI_T157" [0.0d0 1300.0d0] "°C" "15ЖТ_67"

154 "TSI_T158" [0.0d0 1300.0d0] "°C" "15ЖТ_68"
103 "TSI_T103" [0.0d0 1300.0d0] "°C" "15ЖТ_69"
104 "TSI_T104" [0.0d0 1300.0d0] "°C" "15ЖТ_70"
155 "TSI_T159" [0.0d0 1300.0d0] "°C" "15ЖТ_71"
156 "TSI_T160" [0.0d0 1300.0d0] "°C" "15ЖТ_72"
157 "TSI_T161" [0.0d0 1300.0d0] "°C" "15ЖТ_73"
158 "TSI_T162" [0.0d0 1300.0d0] "°C" "15ЖТ_74"
159 "TSI_T163" [0.0d0 1300.0d0] "°C" "15ЖТ_75"
160 "TSI_T164" [0.0d0 1300.0d0] "°C" "15ЖТ_76"


105 "TSI_T105" [0.0d0 1300.0d0] "°C" ""
106 "TSI_T106" [0.0d0 1300.0d0] "°C" ""
107 "TSI_T108" [0.0d0 1300.0d0] "°C" ""
108 "TSI_T109" [0.0d0 1300.0d0] "°C" ""
109 "TSI_T110" [0.0d0 1300.0d0] "°C" ""


