(in-package :recoder/binary)

(defparameter *pangram-ru-1*
  "Съешь же ещё этих мягких французских булок да выпей чаю.")

(defparameter *pangram-ru-2*
  "Широкая электрификация южных губерний даст мощный толчок подъёму сельского хозяйства.")

(defparameter *pangram-ru-3*
  "В чащах юга жил бы цитрус? Да, но фальшивый экземпляр!")

(defparameter *pangram-uk-1*
  "Чуєш їх, доцю, га? Кумедна ж ти, прощайся без ґольфів!")

(defparameter *pangram-uk-2*
  "Жебракують філософи при ґанку церкви в Гадячі, ще й шатро їхнє п'яне знаємо.")

(defparameter *pangram-uk-3*
  "Гей, хлопці, не вспію - на ґанку ваша файна їжа знищується бурундучком.")
